Revit 2026 API

# DividedSurfaceCreate Method

---

Creates a new instance of a divided surface with a default layout.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static DividedSurface Create(
	Document document,
	Reference faceReference
)
```
```vb
Public Shared Function Create (
	document As Document,
	faceReference As Reference
) As DividedSurface
```
```cpp
public:
static DividedSurface^ Create(
	Document^ document,
	Reference^ faceReference
)
```
```fsharp
static member Create :
        document : Document *
        faceReference : Reference -> DividedSurface
```

#### Parameters

document Document
     The document.
faceReference Reference
     Reference that represents a face.

#### Return Value

DividedSurface The newly created divided surface.

| Exception | Condition |
| --- | --- |
| ArgumentException | The document does not allow creation of a divided surface. -or- Reference is unstable import element -or- Reference does not represent a face -or- Reference already hosts a divided surface |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). |
| ModificationForbiddenException | The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process. |
| ModificationOutsideTransactionException | The document has no open transaction. |

#### Reference

DividedSurface Class

Autodesk.Revit.DB Namespace